design/AP-SW-Design.org
# -*- mode: org; org-src-preserve-indentation: t -*-
#+TITLE: Software Design
#+SUBTITLE: Audible-Plot
#+AUTHOR: Daniel Birket &
#+AUTHOR: Lawrence Perez
#+LATEX_HEADER: \usepackage[margin=1.0in]{geometry}
#+LATEX_HEADER: \usepackage{parskip}
#+OPTIONS: toc:nil
#+STARTUP: overview
#+begin_abstract
This document describes the software design for audible-plot.
#+end_abstract

* Class Pitch

This class represents a pitch or frequency and converts between three
pitch and frequency formats.

** Instance Variables

Instances of this class have the following variables:

- _midi: The pitch as a float MIDI number, with the int MIDI number
  expressed as the integer portion and the 'bend' between the notes as
  the float portion after the decimal point.

There are no instance variables for freq and note. These are derived
from _midi by the getter functions.

** Properties

- Integer MIDI note number, 0 to 127
- String note name and octave: "C0" to "C9" including sharps and flats
  like "F#4" and "Eb3"
- Frequency, in Hertz

The internal representation of the pitch will be a MIDI number between
12 and 127, stored as a `float` instead of `integer`. The class must
extend the class "object", not "float".

The frequency corresponding to any pitch can be computed with the formula:

#+begin_math
f = 440 * 2^{(m-69)/12}
#+end_math

Where:
- f: frequency in hertz
- m: MIDI note number, as a float

or in python:

#+begin_src python
freq = 440.0 * 2.0^((midi - 69.0)/12)
#+end_src

In the other direction, the float midi note may be calculated by
inverting the same equation:

#+begin_math
m = 12 * log_{2}(f / 440) + 69
#+end_math

or in python:

#+begin_src python
midi = 12.0 * math.log2(freq / 440.0) + 69.0
#+end_src

When converting from a string to a MIDI note, the string should be of
the format "C0" or "C#0", with the capital note letter name as the
first character, the digit of the octave as the last digit and an
optional "#", "♯" (Unicode "MUSIC SHARP SIGN"), or "+" (PLUS), or a "b", "♭"
(Unicode "MUSIC FLAT SIGN"), or "-" (HYPHEN) character between them.

The octave digit must be 0 to 9. Note that some of octave 0 is below
the range of human hearing. The base MIDI number of each octave is:

| Octave | MIDI |
|--------+------|
|      0 |   12 |
|      1 |   24 |
|      2 |   36 |
|      3 |   48 |
|      4 |   60 |
|      5 |   72 |
|      6 |   84 |
|      7 |   96 |
|      8 |  108 |
|      9 |  120 |
#+TBLFM: $2=12*($1+1)

The base MIDI note of each octave may be computed as:

#+begin_math
base = 12 * (octave + 1)
#+end_math

The octave of a MIDI note may be computed as:

#+begin_math
octave = int((midi - 12) / 12)
#+end_math

This formula produces:

| MIDI | Octave |
|------+--------|
|   12 |      0 |
|   23 |      0 |
|   24 |      1 |
|   35 |      1 |
|   36 |      2 |
|  119 |      8 |
|  120 |      9 |
#+TBLFM: $2=floor(($1-12)/12)

The note letter must be capital A to G. These notes map to an MIDI
note offset from the base of the octave as follows:

| Note | Offset |
|------+--------|
| C    |      0 |
| D    |      2 |
| E    |      4 |
| F    |      5 |
| G    |      7 |
| A    |      9 |
| B    |     11 |

The accidental (sharp or flat) must be one of #, ♯, or + for sharp or
b, ♭, or - for flat. These characters add or subtract one from the
MIDI note number. Double sharps and double flats, if implemented, add
or subtract 2 midi notes. Unusual musical combinations, like "E#4" or "Cb4",
which are the same as "F4" and "B3", respectively, are permitted.

The MIDI number is the sum of the octave base, the note offset and the
+1 or -1 for a sharp or flat, if any

If the string is not of this format, then the conversion should check
if the string is a valid integer or float number in the range greater
than or equal to 12 and less than 128 and interpret a number in that
range as a float MIDI number.

If the string is empty, or the integer is 0, or the float is 0.0, the
pitch should initialize to "A4", a 440 Hz 'A' note.

If the string or integer or float is negative, it should raise a ValueError.

Finally, if the string is a valid integer or float greater than or
equal to 128 and less than or equal to 22000, it should interpret the
value as a frequency.

If the initializer is already an integer or float, it should perform
the same range checks.

If the string is neither a valid note name or a number in one of the
valid ranges for a MIDI note or an audible frequency, it should raise
a ValueError.

If the initializer is not a string, integer or float, note tuple, or another
Pitch, it should raise a TypeError.

Except for the dunder init initializer, which detects the format of the
pitch, Pitch should provide a property() interface to note, midi and
freq fields, with getter and setter methods and doc strings.

When converting from a float MIDI number to a note string, the program
will return a 2-item tuple. The first item of the tuple must be a note
string with note letter, optional sharp sign (using the shift-3 sharp
not the unicode "MUSIC SHARP SIGN", and the octave digit. The note
string represents the integer part of the float MIDI number. The
second item of the tuple must be the fractional part of the MIDI
number, a float number greater than or equal to 0.0 and less than 1.0.

The dunder init initializer should also accept this tuple.

** Methods

In addition to property getters and setters, the class has the
following methods:

- __init__: Initializes a pitch from one of several formats.
- __str__ : Returns a string of the pitch and bend, if any.
- __repl__: Returns a representation of the Pitch

