design/AP-SW-Design.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-04-03 Mon 20:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Software Design</title>
<meta name="author" content="Daniel Birket &amp; Lawrence Perez" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Software Design
<br />
<span class="subtitle">Audible-Plot</span>
</h1>
<div class="abstract" id="org40929c8">
<p>
This document describes the software design for audible-plot.
</p>

</div>

<div id="outline-container-orgf99053d" class="outline-2">
<h2 id="orgf99053d"><span class="section-number-2">1.</span> Class Pitch</h2>
<div class="outline-text-2" id="text-1">
<p>
This class represents a pitch or frequency and converts between three
pitch and frequency formats.
</p>
</div>

<div id="outline-container-org0727b86" class="outline-3">
<h3 id="org0727b86"><span class="section-number-3">1.1.</span> Instance Variables</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Instances of this class have the following variables:
</p>

<ul class="org-ul">
<li>_midi: The pitch as a float MIDI number, with the int MIDI number
expressed as the integer portion and the 'bend' between the notes as
the float portion after the decimal point.</li>
</ul>

<p>
There are no instance variables for freq and note. These are derived
from _midi by the getter functions.
</p>
</div>
</div>

<div id="outline-container-org7bfa08c" class="outline-3">
<h3 id="org7bfa08c"><span class="section-number-3">1.2.</span> Properties</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Integer MIDI note number, 0 to 127</li>
<li>String note name and octave: "C0" to "C9" including sharps and flats
like "F#4" and "Eb3"</li>
<li>Frequency, in Hertz</li>
</ul>

<p>
The internal representation of the pitch will be a MIDI number between
12 and 127, stored as a `float` instead of `integer`. The class must
extend the class "object", not "float".
</p>

<p>
The frequency corresponding to any pitch can be computed with the formula:
</p>

<div class="math" id="org2111669">
<p>
f = 440 * 2<sup>(m-69)/12</sup>
</p>

</div>

<p>
Where:
</p>
<ul class="org-ul">
<li>f: frequency in hertz</li>
<li>m: MIDI note number, as a float</li>
</ul>

<p>
or in python:
</p>

<div class="org-src-container">
<pre class="src src-python">freq = 440.0 * 2.0^((midi - 69.0)/12)
</pre>
</div>

<p>
In the other direction, the float midi note may be calculated by
inverting the same equation:
</p>

<div class="math" id="org2e91dbf">
<p>
m = 12 * log<sub>2</sub>(f / 440) + 69
</p>

</div>

<p>
or in python:
</p>

<div class="org-src-container">
<pre class="src src-python">midi = 12.0 * math.log2(freq / 440.0) + 69.0
</pre>
</div>

<p>
When converting from a string to a MIDI note, the string should be of
the format "C0" or "C#0", with the capital note letter name as the
first character, the digit of the octave as the last digit and an
optional "#", "♯" (Unicode "MUSIC SHARP SIGN"), or "+" (PLUS), or a "b", "♭"
(Unicode "MUSIC FLAT SIGN"), or "-" (HYPHEN) character between them.
</p>

<p>
The octave digit must be 0 to 9. Note that some of octave 0 is below
the range of human hearing. The base MIDI number of each octave is:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Octave</th>
<th scope="col" class="org-right">MIDI</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-right">12</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">24</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-right">36</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-right">48</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-right">60</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-right">72</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-right">84</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-right">96</td>
</tr>

<tr>
<td class="org-right">8</td>
<td class="org-right">108</td>
</tr>

<tr>
<td class="org-right">9</td>
<td class="org-right">120</td>
</tr>
</tbody>
</table>

<p>
The base MIDI note of each octave may be computed as:
</p>

<div class="math" id="org0149f98">
<p>
base = 12 * (octave + 1)
</p>

</div>

<p>
The octave of a MIDI note may be computed as:
</p>

<div class="math" id="org3d76e7d">
<p>
octave = int((midi - 12) / 12)
</p>

</div>

<p>
This formula produces:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">MIDI</th>
<th scope="col" class="org-right">Octave</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">12</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">23</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">24</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">35</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">36</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-right">119</td>
<td class="org-right">8</td>
</tr>

<tr>
<td class="org-right">120</td>
<td class="org-right">9</td>
</tr>
</tbody>
</table>

<p>
The note letter must be capital A to G. These notes map to an MIDI
note offset from the base of the octave as follows:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Note</th>
<th scope="col" class="org-right">Offset</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">D</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-left">E</td>
<td class="org-right">4</td>
</tr>

<tr>
<td class="org-left">F</td>
<td class="org-right">5</td>
</tr>

<tr>
<td class="org-left">G</td>
<td class="org-right">7</td>
</tr>

<tr>
<td class="org-left">A</td>
<td class="org-right">9</td>
</tr>

<tr>
<td class="org-left">B</td>
<td class="org-right">11</td>
</tr>
</tbody>
</table>

<p>
The accidental (sharp or flat) must be one of #, ♯, or + for sharp or
b, ♭, or - for flat. These characters add or subtract one from the
MIDI note number. Double sharps and double flats, if implemented, add
or subtract 2 midi notes. Unusual musical combinations, like "E#4" or "Cb4",
which are the same as "F4" and "B3", respectively, are permitted.
</p>

<p>
The MIDI number is the sum of the octave base, the note offset and the
+1 or -1 for a sharp or flat, if any
</p>

<p>
If the string is not of this format, then the conversion should check
if the string is a valid integer or float number in the range greater
than or equal to 12 and less than 128 and interpret a number in that
range as a float MIDI number.
</p>

<p>
If the string is empty, or the integer is 0, or the float is 0.0, the
pitch should initialize to "A4", a 440 Hz 'A' note.
</p>

<p>
If the string or integer or float is negative, it should raise a ValueError.
</p>

<p>
Finally, if the string is a valid integer or float greater than or
equal to 128 and less than or equal to 22000, it should interpret the
value as a frequency.
</p>

<p>
If the initializer is already an integer or float, it should perform
the same range checks.
</p>

<p>
If the string is neither a valid note name or a number in one of the
valid ranges for a MIDI note or an audible frequency, it should raise
a ValueError.
</p>

<p>
If the initializer is not a string, integer or float, note tuple, or another
Pitch, it should raise a TypeError.
</p>

<p>
Except for the dunder init initializer, which detects the format of the
pitch, Pitch should provide a property() interface to note, midi and
freq fields, with getter and setter methods and doc strings.
</p>

<p>
When converting from a float MIDI number to a note string, the program
will return a 2-item tuple. The first item of the tuple must be a note
string with note letter, optional sharp sign (using the shift-3 sharp
not the unicode "MUSIC SHARP SIGN", and the octave digit. The note
string represents the integer part of the float MIDI number. The
second item of the tuple must be the fractional part of the MIDI
number, a float number greater than or equal to 0.0 and less than 1.0.
</p>

<p>
The dunder init initializer should also accept this tuple.
</p>
</div>
</div>

<div id="outline-container-org130751d" class="outline-3">
<h3 id="org130751d"><span class="section-number-3">1.3.</span> Methods</h3>
<div class="outline-text-3" id="text-1-3">
<p>
In addition to property getters and setters, the class has the
following methods:
</p>

<ul class="org-ul">
<li>__init__: Initializes a pitch from one of several formats.</li>
<li>__str__ : Returns a string of the pitch and bend, if any.</li>
<li>__repl__: Returns a representation of the Pitch</li>
</ul>
</div>
</div>
