design/AP-SW-Design.org
** Interface

The class Pitch must have the following interface:

#+begin_src python :tangle pitch_face.py
"""Temporary module to document the Pitch class"""
from typing import Any


class Pitch(object):

    # Getter and Setter of midi (same as internal _midi)
    @property
    def midi(self) -> float:
        "float MIDI number of pitch."
        return self._midi

    @midi.setter
    def midi(self, m: float) -> None:
        assert isinstance(m, int) or isinstance(m, float)
        # assert valid 12 to 127 midi number here
        self._midi = float(m)
        pass

    @midi.deleter
    def midi(self) -> None:
        self._midi = 69.0  # "A4", 440 Hz 'A'
        pass

    # Getter and Setter of frequency
    @property
    def freq(self) -> float:
        "float frequence of pitch in hertz."
        return 0.0

    @freq.setter
    def freq(self, f: float) -> None:
        assert isinstance(f, int) or isinstance(f, float)
        # assert audible frequency range here
        self._midi = 0.0
        pass

    @freq.deleter
    def freq(self) -> None:
        del self.midi
        pass

    # Getter and Setter of note string
    @property
    def note(self) -> tuple:
        "pitch as tuple of note string and fractional note."
        return ("A4", 0.0)

    @note.setter
    def note(self, n) -> None:
        if isinstance(n, tuple):
            note_str, note_bend = n  # unpack tuple
        elif isinstance(n, str):
            note_str = n
            note_bend = 0.0
        assert isinstance(note_str, str), "Note string must be a string like 'A4'."
        assert isinstance(note_bend, float), "Note bend must be a float like 0.0."
        assert 0.0 <= note_bend < 1.0, "Note bend must 0.0 or between 0.0 and 1.0."

        self._midi = 0.0
        pass

    @note.deleter
    def note(self) -> None:
        del self.midi
        pass
    
    def __init__(self, value: Any = None) -> None:
        pass
        if isinstance(value, tuple) or isinstance(value, str):
            self.note = value
        elif isinstance(value, float) or isinstance(value, int):
            if value < 128.0:
                self.midi = value
            else:
                self.freq = value
        else:
            raise TypeError("value must be tuple, string, float or int.")

        # if isinstance(value, int) or isinstance(value, float)
        midi = 0
        pass

    def __str__(self) -> str:
        """Return string of note and bend."""
        n = self.note
        return n[0] + "+" + str(n[1])

    def __repl__(self) -> str:
        """Return represenation of Pitch."""
        return type(self).__name__ + "(" + self.midi + ")"
#+end_src

* Class PlotData

This class describes the data to be plotted (either visually or
audibly).

** Instance Variables

Instances of this class have the following variables:

- _points: a NumPy ndarray of the points, with the x values in the
  first position.
- _xrange: The min and max of the x coordinates of the points
- _yrange: The min and max of the y coordinates of the points
- _xlabel: The x-axis label
- _ylabel: The y-axis label
- _xdescr: A verbose description of the x-data
- _ydescr: A verbose description of the y-data.
- _line_labels: A list of strings labeling the lines, one for each line.
- _line_descrs: A list of strings describing the lines, one for each line.
- _title: The title of the plot
- _description: A verbose description of the plot

** Properties

This class has the following properties, with automatic getters and setters.

- points: an m by n matrix (numpy ndarray) of floats giving the horizontal x-axis
  coordinates in the m = 0 column and the vertical y-axis coordinates
  of the points to plot for m-1 lines in the remaining columns.

  - the number of horizontal x coordinates, n, is expected to be
    between 2 and 100

  - the number of sets of vertical y coordinates (ie. functions) is
    expected to be between 1 and 9, so `m`, which includes the x
    coordinates, will be between 2 and 10.

  - the array is stored as a vector (list) of points, where each point
    is a vector of at least two floats: (x, y1). `points[0]`
    is the first set of points at the x-position points[0,0].

- xrange: a tuple of two floats (min, max). The horizontal range to
  plot. If set to (0,0) or min = max, the range will be calculated
  from the points array. If (min > max), they will be swapped.

- yrange: a type of two floats (min, max). The vertical range to
  plot. If set to (0,0) or min = max, the range will be calculated
  from the points array. If (min > max), they will be swapped.

- xlabel, ylabel: a (short) string used to label the x and y axis
  respectively. Defaults to "x" and "y".

- xdescr, ydescr: a (verbose) string describing the x and y axis
  respectively. Defaults to empty.

- line_labels: a list of (short) strings labeling the lines. Defaults
  to "Line 1", "Line 2", etc. if there are two or more lines. Defaults
  to ylabel if there is only one line.

- line_descrs: a list of (verbose) strings describing the lines:
  Defaults to the respective line_labels.

- title: a (short) string used to title the entire plot. Defaults to
  "<xlabel> versus <ylabel>"

- description: a (verbose) string describing the entire plot. Defaults
  to empty.

** Methods

In addition to property getters and setters, the class has the
following methods:

- autoxrange(): set xrange based on the points.
- autoyrange(): set yrange based on the points.

- xsize(): get the number of points horizontally. Sames as n of points[m,n]
- ysize(): get the number of functions vertically. Same as m-1 of
  points [m,n]

