design/AP-SW-Design.html

<div id="outline-container-org6bfb099" class="outline-3">
<h3 id="org6bfb099"><span class="section-number-3">1.4.</span> Interface</h3>
<div class="outline-text-3" id="text-1-4">
<p>
The class Pitch must have the following interface:
</p>

<div class="org-src-container">
<pre class="src src-python">"""Temporary module to document the Pitch class"""
from typing import Any


class Pitch(object):

    # Getter and Setter of midi (same as internal _midi)
    @property
    def midi(self) -&gt; float:
        "float MIDI number of pitch."
        return self._midi

    @midi.setter
    def midi(self, m: float) -&gt; None:
        assert isinstance(m, int) or isinstance(m, float)
        # assert valid 12 to 127 midi number here
        self._midi = float(m)
        pass

    @midi.deleter
    def midi(self) -&gt; None:
        self._midi = 69.0  # "A4", 440 Hz 'A'
        pass

    # Getter and Setter of frequency
    @property
    def freq(self) -&gt; float:
        "float frequence of pitch in hertz."
        return 0.0

    @freq.setter
    def freq(self, f: float) -&gt; None:
        assert isinstance(f, int) or isinstance(f, float)
        # assert audible frequency range here
        self._midi = 0.0
        pass

    @freq.deleter
    def freq(self) -&gt; None:
        del self.midi
        pass

    # Getter and Setter of note string
    @property
    def note(self) -&gt; tuple:
        "pitch as tuple of note string and fractional note."
        return ("A4", 0.0)

    @note.setter
    def note(self, n) -&gt; None:
        if isinstance(n, tuple):
            note_str, note_bend = n  # unpack tuple
        elif isinstance(n, str):
            note_str = n
            note_bend = 0.0
        assert isinstance(note_str, str), "Note string must be a string like 'A4'."
        assert isinstance(note_bend, float), "Note bend must be a float like 0.0."
        assert 0.0 &lt;= note_bend &lt; 1.0, "Note bend must 0.0 or between 0.0 and 1.0."

        self._midi = 0.0
        pass

    @note.deleter
    def note(self) -&gt; None:
        del self.midi
        pass
    
    def __init__(self, value: Any = None) -&gt; None:
        pass
        if isinstance(value, tuple) or isinstance(value, str):
            self.note = value
        elif isinstance(value, float) or isinstance(value, int):
            if value &lt; 128.0:
                self.midi = value
            else:
                self.freq = value
        else:
            raise TypeError("value must be tuple, string, float or int.")

        # if isinstance(value, int) or isinstance(value, float)
        midi = 0
        pass

    def __str__(self) -&gt; str:
        """Return string of note and bend."""
        n = self.note
        return n[0] + "+" + str(n[1])

    def __repl__(self) -&gt; str:
        """Return represenation of Pitch."""
        return type(self).__name__ + "(" + self.midi + ")"
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgcb3ad9e" class="outline-2">
<h2 id="orgcb3ad9e"><span class="section-number-2">2.</span> Class PlotData</h2>
<div class="outline-text-2" id="text-2">
<p>
This class describes the data to be plotted (either visually or
audibly).
</p>
</div>

<div id="outline-container-orge10992f" class="outline-3">
<h3 id="orge10992f"><span class="section-number-3">2.1.</span> Instance Variables</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Instances of this class have the following variables:
</p>

<ul class="org-ul">
<li>_points: a NumPy ndarray of the points, with the x values in the
first position.</li>
<li>_xrange: The min and max of the x coordinates of the points</li>
<li>_yrange: The min and max of the y coordinates of the points</li>
<li>_xlabel: The x-axis label</li>
<li>_ylabel: The y-axis label</li>
<li>_xdescr: A verbose description of the x-data</li>
<li>_ydescr: A verbose description of the y-data.</li>
<li>_line_labels: A list of strings labeling the lines, one for each line.</li>
<li>_line_descrs: A list of strings describing the lines, one for each line.</li>
<li>_title: The title of the plot</li>
<li>_description: A verbose description of the plot</li>
</ul>
</div>
</div>

<div id="outline-container-orgea5cc5e" class="outline-3">
<h3 id="orgea5cc5e"><span class="section-number-3">2.2.</span> Properties</h3>
<div class="outline-text-3" id="text-2-2">
<p>
This class has the following properties, with automatic getters and setters.
</p>

<ul class="org-ul">
<li>points: an m by n matrix (numpy ndarray) of floats giving the horizontal x-axis
coordinates in the m = 0 column and the vertical y-axis coordinates
of the points to plot for m-1 lines in the remaining columns.

<ul class="org-ul">
<li>the number of horizontal x coordinates, n, is expected to be
between 2 and 100</li>

<li>the number of sets of vertical y coordinates (ie. functions) is
expected to be between 1 and 9, so `m`, which includes the x
coordinates, will be between 2 and 10.</li>

<li>the array is stored as a vector (list) of points, where each point
is a vector of at least two floats: (x, y1). `points[0]`
is the first set of points at the x-position points[0,0].</li>
</ul></li>

<li>xrange: a tuple of two floats (min, max). The horizontal range to
plot. If set to (0,0) or min = max, the range will be calculated
from the points array. If (min &gt; max), they will be swapped.</li>

<li>yrange: a type of two floats (min, max). The vertical range to
plot. If set to (0,0) or min = max, the range will be calculated
from the points array. If (min &gt; max), they will be swapped.</li>

<li>xlabel, ylabel: a (short) string used to label the x and y axis
respectively. Defaults to "x" and "y".</li>

<li>xdescr, ydescr: a (verbose) string describing the x and y axis
respectively. Defaults to empty.</li>

<li>line_labels: a list of (short) strings labeling the lines. Defaults
to "Line 1", "Line 2", etc. if there are two or more lines. Defaults
to ylabel if there is only one line.</li>

<li>line_descrs: a list of (verbose) strings describing the lines:
Defaults to the respective line_labels.</li>

<li>title: a (short) string used to title the entire plot. Defaults to
"&lt;xlabel&gt; versus &lt;ylabel&gt;"</li>

<li>description: a (verbose) string describing the entire plot. Defaults
to empty.</li>
</ul>
</div>
</div>

<div id="outline-container-org63c223f" class="outline-3">
<h3 id="org63c223f"><span class="section-number-3">2.3.</span> Methods</h3>
<div class="outline-text-3" id="text-2-3">
<p>
In addition to property getters and setters, the class has the
following methods:
</p>

<ul class="org-ul">
<li>autoxrange(): set xrange based on the points.</li>
<li>autoyrange(): set yrange based on the points.</li>

<li>xsize(): get the number of points horizontally. Sames as n of points[m,n]</li>
<li>ysize(): get the number of functions vertically. Same as m-1 of
points [m,n]</li>
</ul>
</div>
</div>
