design/AP-SW-Design.html

<div id="outline-container-orgdec9a7d" class="outline-3">
<h3 id="orgdec9a7d"><span class="section-number-3">2.4.</span> Interface</h3>
<div class="outline-text-3" id="text-2-4">
<p>
The class must have the following interface:
</p>

<div class="org-src-container">
<pre class="src src-python">"""Temporary module to document the PlotData class"""
import numpy as np
import math

class PlotData(object):
    """Class to hold data to be plotted and associated descriptors."""

    def __init__(self, p: np.ndarray) -&gt; None:
        """Initialize the plot data from the array. Default the rest."""
        self._points: np.ndarray = p
        self.autoxrange()
        self.autoyrange()
        self._xlabel: str = "x"
        self._ylabel: str = "y"
        self._xdescr: str  = ""
        self._ydescr: str  = ""
        self._title: str = ""
        self._description: str = ""
        self._line_labels: list[str] = []
        self._line_descrs: list[str] = []
        pass

    @property
    def points(self) -&gt; np.ndarray:
        """Numpy n-dimension array of points. X-values first."""
        return self._points

    @points.setter
    def points(self, p: np.ndarray) -&gt; None:
        self._points = p
        pass

    @points.deleter
    def points(self) -&gt; None:
        self._points = np.ndarray([[0, 0], [1, 1]])
        pass


    @property
    def xrange(self) -&gt; tuple[float, float]:
        """Min and Max of the x-values."""
        return self._xrange

    @xrange.setter
    def xrange(self, xr: tuple[float, float]) -&gt; None:
        """Set the min and max of the x-values. If min = max, then
        perform autoxrange. If min &gt; max, then swap them."""
        self._xrange = xr
        pass

    @xrange.deleter
    def xrange(self) -&gt; None:
        self.xrange = (0, 0)
        pass


    @property
    def yrange(self) -&gt; tuple[float, float]:
        """Min and Max of the y-values, for all functions."""
        return self._yrange

    @yrange.setter
    def yrange(self, yr: tuple[float, float]) -&gt; None:
        """Set the min and max of the y-values. If min = max, then
        perform autoyrange. If min &gt; max, then swap them."""
        self._yrange = yr
        pass

    @yrange.deleter
    def yrange(self) -&gt; None:
        self.yrange = (0, 0)
        pass


    @property
    def xlabel(self) -&gt; str:
        """Short label of x-axis"""
        return self._xlabel

    @xlabel.setter
    def xlabel(self, xl: str):
        self._xlabel = xl
        pass

    @xlabel.deleter
    def xlabel(self) -&gt; None:
        self._xlabel = ""
        pass


    @property
    def ylabel(self) -&gt; str:
        """Short label of y-axis"""
        return self._ylabel

    @ylabel.setter
    def ylabel(self, yl: str):
        self._ylabel = yl
        pass

    @ylabel.deleter
    def ylabel(self) -&gt; None:
        self._ylabel = ""
        pass


    @property
    def xdescr(self) -&gt; str:
        """Verbose description of x-data."""
        return self._xdescr

    @xdescr.setter
    def xdescr(self, xd: str):
        self._xdescr = xd
        pass

    @xdescr.deleter
    def xdescr(self) -&gt; None:
        self._xdescr = ""
        pass


    @property
    def ydescr(self) -&gt; str:
        """Verbose description of y-data."""
        return self._ydescr

    @ydescr.setter
    def ydescr(self, yd: str):
        self._ydescr = yd
        pass

    @ydescr.deleter
    def ydescr(self) -&gt; None:
        self._ydescr = ""
        pass


    @property
    def line_labels(self) -&gt; list[str]:
        """List of labels for lines."""
        return self._line_labels

    @line_labels.setter
    def line_labels(self, ll: list[str]) -&gt; None:
        self._line_labels = ll
        pass

    @line_labels.deleter
    def line_labels(self) -&gt; None:
        self._line_labels = ["" for _ in range(self.ysize)]
        pass


    @property
    def line_descrs(self) -&gt; list[str]:
        """List of labels for lines."""
        return self._line_descrs

    @line_descrs.setter
    def line_descrs(self, ld: list[str]) -&gt; None:
        self._line_descrs = ld
        pass

    @line_descrs.deleter
    def line_descrs(self) -&gt; None:
        self._line_descrs = ["" for _ in range(self.ysize)]
        pass


    @property
    def title(self) -&gt; str:
        """Title of plot."""
        if self._title:
            return self._title
        else:
            return self.ylabel + " versus " + self.xlabel

    @title.setter
    def title(self, t: str) -&gt; None:
        self._title = t
        pass

    @title.deleter
    def title(self) -&gt; None:
        self._title = ""
        pass


    @property
    def description(self) -&gt; str:
        """Verbose description of plot."""
        return self._description

    @description.setter
    def description(self, d: str) -&gt; None:
        self._description = d
        pass

    @description.deleter
    def description(self) -&gt; None:
        self._description = ""
        pass


    @property
    def line_labels(self) -&gt; list[str]:
        """List of strings of line labels for legend."""
        if _line_labels:
            return _line_labels
        else:
            ys = self.ysize()
            if ys &gt; 1:
                _line_labels = ["Line "+str(i) for i in range(1, ys+1)]
            else:
                _line_labels = self.ylabel

    @line_labels.setter
    def line_labels(self, ll: list[str]) -&gt; None:
        self._line_labels = ll
        pass

    @line_labels.deleter
    def line_labels(self) -&gt; None:
        _line_labels = []
        pass

    @property
    def line_descrs(self) -&gt; list[str]:
        """List of strings of line descriptions."""
        return _line_descrs

    @line_descrs.setter
    def line_descrs(self, ld: list[str]) -&gt; None:
        self._line_descrs = ld
        pass

    @line_descrs.deleter
    def line_descrs(self) -&gt; None:
        _line_descrs = []
        pass


    @staticmethod
    def round_range(r: tuple[float, float]) -&gt; float:
        """Round the min and max down and up to the next round interval"""
        ad = abs(r[1] - r[0])   # absolute distance from min to max
        dp = int(math.log10(ad))     # position of decimal point
        fac = 10^dp                  # factor of decimal point
        lo = math.floor(r[0] / fac) * fac
        hi = math.ceil(r[1] / fac) * fac
        return (lo, hi)        
                
    def autoxrange(self) -&gt; None:
        """Set the min and max of the x values, rounded down and up
        the order (log10) of the difference between the data min and max."""
        self._xrange = (0.0, 1.0)
        pass

    def autoyrange(self) -&gt; None:
        """Set the min and max of the y values, rounded down and up
        the order (log10) of the difference between the data min and max."""
        self._yrange = (0.0, 1.0)
        pass

    def xsize(self) -&gt; int:
        """Get n, the x dimension size of the point array."""
        return 0

    def ysize(self) -&gt; int:
        """Get m, the number of y functions in the point array."""
        return 0
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf9145d0" class="outline-2">
<h2 id="orgf9145d0"><span class="section-number-2">3.</span> Class PlotVisual</h2>
<div class="outline-text-2" id="text-3">
<p>
This class describes and creates the desired visual plot of the data
described by the PlotData class.
</p>
</div>


<div id="outline-container-org6e78cf3" class="outline-3">
<h3 id="org6e78cf3"><span class="section-number-3">3.1.</span> Instance Variables</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Instances of this class have the following variables:
</p>

<ul class="org-ul">
<li>_filetype: one of "png", "gif", or "jpeg"</li>
<li>_output: name of the gp and output file, less the file extension</li>
<li>_size: tuple of (xpixels, ypixels)</li>
</ul>
</div>
</div>
