design/AP-SW-Design.org
** Class Constants

The class defines the following constants:

- filetypes: list[str]. ["png", "gif", "jpeg", "svg"]

  Considering using class enum.StrEnum from enum.py instead of string.
#+begin_src python
import enum

class FileType(enum.StrEnum):
    PNG = enum.auto()
    GIF = enum.auto()
    JPEG = enum.auto()
    SVG = enum.auto()
#+end_src

** Properties

This class has the following properties, with automatic getters and
setters.

- filetype: Type (and extension) of the graphics file. One of "svg", "png", "jpeg", or
  "gif". The default is "png". If set to another string, the default
  will be used. The filetype is used to set the filetype of the output of
  gnuplot and to set the output filename extension.

- output: name of the graphics file and the gp file. If nothing is specified, the
  title of the plotdata will be used. The filetype will be appended to
  this string to set the output filename. `.gp` is appended to create
  the gp filename. May not contain "gp" or one of the filetype strings.
- size: the x and y size of the graphic in pixels. A tuple (xpixels,
  ypixels). The default is (640, 480).

** Methods

In addition to property getters and setters, the class has the
following methods:

- __init__(plotdata: PlotData) -> None: Initialize the PlotVisual object.
- out_filename() -> str: Get complete output filename assembled from `output`
  and the selected `filetype`.
- tsv_filename() -> str: Get the complete tab-separated-values filename
  assembled from 'output' and '.tsv'
- gp_filename() -> str: Get complete gnuplot filename assembled from `output` and
  `.gp`
- write_tsv() -> None: Write the `.tsv` data points file (with header line).
- write_gp() -> None: Write the `gp` command file (referencing tsv file).
- plot_gp() -> None: Plot the `.gp` command file with `gnuplot`.

** Interface

The class must have the following interface:

#+begin_src python :tangle plotvisual_face.py
"""Temporary Module to document the PlotVisual class."""

import enum
import math
import plotdata_face


class FileType(enum.StrEnum):
    """Enumeration of plot graphic file types."""

    PNG = enum.auto()
    GIF = enum.auto()
    JPEG = enum.auto()
    SVG = enum.auto()


class PlotVisual(object):
    """Class to define and visually plot a PlotData object."""

    def __init__(self, pd: PlotData) -> None:
        """Initialize a visual plot with PlotData."""
        self._filetype = FileType.PNG
        self._output = "plot"
        self._size = (640, 480)
        pass

    @property
    def filetype(self) -> FileType:
        "Type of output file. `png`, `gif`, `jpeg`, or `svg`."
        return self._filetype

    @filetype.setter
    def filetype(self, ft: FileType) -> None:
        self._filetype = ft
        pass

    @property
    def output(self) -> str:
        """Name of output graphic, tsv and gp files."""
        return self._output

    @output.setter
    def output(self, out: str) -> None:
        self._output = out
        pass

    @property
    def size(self) -> tuple[int, int]:
        return self._size

    @size.setter
    def size(self, s: tuple[int, int]):
        self._size = s
        pass

    def out_filename(self) -> str:
        """Get the output graphic filename from `output` and `filetype`."""
        return ""

    def tsv_filename(self) -> str:
        """Get the tab-seperated-values data filename from `output` and `.tsv`."""
        return ""

    def gp_filename(self) -> str:
        """Get the gnuplot commands filename from `output` and `.gp`."""
        return ""

    def write_tsv(self) -> None:
        """Write the `.tsv` data file with headers and data."""
        pass

    def write_gp(self) -> None:
        """Write the `.gp` commands file."""
        pass
#+end_src
