design/AP-SW-Design.html

<div id="outline-container-orgbbac8f9" class="outline-3">
<h3 id="orgbbac8f9"><span class="section-number-3">3.2.</span> Class Constants</h3>
<div class="outline-text-3" id="text-3-2">
<p>
The class defines the following constants:
</p>

<ul class="org-ul">
<li><p>
filetypes: list[str]. ["png", "gif", "jpeg", "svg"]
</p>

<p>
Considering using class enum.StrEnum from enum.py instead of string.
</p></li>
</ul>
<div class="org-src-container">
<pre class="src src-python">import enum

class FileType(enum.StrEnum):
    PNG = enum.auto()
    GIF = enum.auto()
    JPEG = enum.auto()
    SVG = enum.auto()
</pre>
</div>
</div>
</div>

<div id="outline-container-orgef08e29" class="outline-3">
<h3 id="orgef08e29"><span class="section-number-3">3.3.</span> Properties</h3>
<div class="outline-text-3" id="text-3-3">
<p>
This class has the following properties, with automatic getters and
setters.
</p>

<ul class="org-ul">
<li>filetype: Type (and extension) of the graphics file. One of "svg", "png", "jpeg", or
"gif". The default is "png". If set to another string, the default
will be used. The filetype is used to set the filetype of the output of
gnuplot and to set the output filename extension.</li>

<li>output: name of the graphics file and the gp file. If nothing is specified, the
title of the plotdata will be used. The filetype will be appended to
this string to set the output filename. `.gp` is appended to create
the gp filename. May not contain "gp" or one of the filetype strings.</li>
<li>size: the x and y size of the graphic in pixels. A tuple (xpixels,
ypixels). The default is (640, 480).</li>
</ul>
</div>
</div>

<div id="outline-container-org82258ee" class="outline-3">
<h3 id="org82258ee"><span class="section-number-3">3.4.</span> Methods</h3>
<div class="outline-text-3" id="text-3-4">
<p>
In addition to property getters and setters, the class has the
following methods:
</p>

<ul class="org-ul">
<li>__init__(plotdata: PlotData) -&gt; None: Initialize the PlotVisual object.</li>
<li>out_filename() -&gt; str: Get complete output filename assembled from `output`
and the selected `filetype`.</li>
<li>tsv_filename() -&gt; str: Get the complete tab-separated-values filename
assembled from 'output' and '.tsv'</li>
<li>gp_filename() -&gt; str: Get complete gnuplot filename assembled from `output` and
`.gp`</li>
<li>write_tsv() -&gt; None: Write the `.tsv` data points file (with header line).</li>
<li>write_gp() -&gt; None: Write the `gp` command file (referencing tsv file).</li>
<li>plot_gp() -&gt; None: Plot the `.gp` command file with `gnuplot`.</li>
</ul>
</div>
</div>

<div id="outline-container-org39a3560" class="outline-3">
<h3 id="org39a3560"><span class="section-number-3">3.5.</span> Interface</h3>
<div class="outline-text-3" id="text-3-5">
<p>
The class must have the following interface:
</p>

<div class="org-src-container">
<pre class="src src-python">"""Temporary Module to document the PlotVisual class."""

import enum
import math
import plotdata_face


class FileType(enum.StrEnum):
    """Enumeration of plot graphic file types."""

    PNG = enum.auto()
    GIF = enum.auto()
    JPEG = enum.auto()
    SVG = enum.auto()


class PlotVisual(object):
    """Class to define and visually plot a PlotData object."""

    def __init__(self, pd: PlotData) -&gt; None:
        """Initialize a visual plot with PlotData."""
        self._filetype = FileType.PNG
        self._output = "plot"
        self._size = (640, 480)
        pass

    @property
    def filetype(self) -&gt; FileType:
        "Type of output file. `png`, `gif`, `jpeg`, or `svg`."
        return self._filetype

    @filetype.setter
    def filetype(self, ft: FileType) -&gt; None:
        self._filetype = ft
        pass

    @property
    def output(self) -&gt; str:
        """Name of output graphic, tsv and gp files."""
        return self._output

    @output.setter
    def output(self, out: str) -&gt; None:
        self._output = out
        pass

    @property
    def size(self) -&gt; tuple[int, int]:
        return self._size

    @size.setter
    def size(self, s: tuple[int, int]):
        self._size = s
        pass

    def out_filename(self) -&gt; str:
        """Get the output graphic filename from `output` and `filetype`."""
        return ""

    def tsv_filename(self) -&gt; str:
        """Get the tab-seperated-values data filename from `output` and `.tsv`."""
        return ""

    def gp_filename(self) -&gt; str:
        """Get the gnuplot commands filename from `output` and `.gp`."""
        return ""

    def write_tsv(self) -&gt; None:
        """Write the `.tsv` data file with headers and data."""
        pass

    def write_gp(self) -&gt; None:
        """Write the `.gp` commands file."""
        pass
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Birket &amp; Lawrence Perez</p>
<p class="date">Created: 2023-04-03 Mon 20:21</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>